modm-ext/archive-stmicro-svd/html_rm0090_stm32f437aih6.svd
        <register>
          <name>FGCLUT.133</name>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.134</name>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.135</name>
          <addressOffset>0x61c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.136</name>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.137</name>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.138</name>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.139</name>
          <addressOffset>0x62c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.140</name>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.141</name>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.142</name>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.143</name>
          <addressOffset>0x63c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.144</name>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.145</name>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.146</name>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.147</name>
          <addressOffset>0x64c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.148</name>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.149</name>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.150</name>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.151</name>
          <addressOffset>0x65c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.152</name>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.153</name>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.154</name>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.155</name>
          <addressOffset>0x66c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.156</name>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.157</name>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.158</name>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.159</name>
          <addressOffset>0x67c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.160</name>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.161</name>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.162</name>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.163</name>
          <addressOffset>0x68c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.164</name>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.165</name>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.166</name>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.167</name>
          <addressOffset>0x69c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.168</name>
          <addressOffset>0x6a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.169</name>
          <addressOffset>0x6a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.170</name>
          <addressOffset>0x6a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.171</name>
          <addressOffset>0x6ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.172</name>
          <addressOffset>0x6b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.173</name>
          <addressOffset>0x6b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.174</name>
          <addressOffset>0x6b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.175</name>
          <addressOffset>0x6bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.176</name>
          <addressOffset>0x6c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.177</name>
          <addressOffset>0x6c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.178</name>
          <addressOffset>0x6c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.179</name>
          <addressOffset>0x6cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.180</name>
          <addressOffset>0x6d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.181</name>
          <addressOffset>0x6d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.182</name>
          <addressOffset>0x6d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.183</name>
          <addressOffset>0x6dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.184</name>
          <addressOffset>0x6e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.185</name>
          <addressOffset>0x6e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.186</name>
          <addressOffset>0x6e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.187</name>
          <addressOffset>0x6ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.188</name>
          <addressOffset>0x6f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.189</name>
          <addressOffset>0x6f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.190</name>
          <addressOffset>0x6f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.191</name>
          <addressOffset>0x6fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.192</name>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.193</name>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.194</name>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.195</name>
          <addressOffset>0x70c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.196</name>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.197</name>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.198</name>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.199</name>
          <addressOffset>0x71c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.200</name>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.201</name>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.202</name>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.203</name>
          <addressOffset>0x72c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.204</name>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.205</name>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.206</name>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.207</name>
          <addressOffset>0x73c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.208</name>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.209</name>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.210</name>
          <addressOffset>0x748</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.211</name>
          <addressOffset>0x74c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.212</name>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.213</name>
          <addressOffset>0x754</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.214</name>
          <addressOffset>0x758</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.215</name>
          <addressOffset>0x75c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.216</name>
          <addressOffset>0x760</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.217</name>
          <addressOffset>0x764</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.218</name>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.219</name>
          <addressOffset>0x76c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.220</name>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.221</name>
          <addressOffset>0x774</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.222</name>
          <addressOffset>0x778</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.223</name>
          <addressOffset>0x77c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.224</name>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.225</name>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.226</name>
          <addressOffset>0x788</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.227</name>
          <addressOffset>0x78c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.228</name>
          <addressOffset>0x790</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.229</name>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.230</name>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.231</name>
          <addressOffset>0x79c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.232</name>
          <addressOffset>0x7a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.233</name>
          <addressOffset>0x7a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.234</name>
          <addressOffset>0x7a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.235</name>
          <addressOffset>0x7ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.236</name>
          <addressOffset>0x7b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.237</name>
          <addressOffset>0x7b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.238</name>
          <addressOffset>0x7b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.239</name>
          <addressOffset>0x7bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.240</name>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.241</name>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.242</name>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.243</name>
          <addressOffset>0x7cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.244</name>
          <addressOffset>0x7d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.245</name>
          <addressOffset>0x7d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.246</name>
          <addressOffset>0x7d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.247</name>
          <addressOffset>0x7dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.248</name>
          <addressOffset>0x7e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.249</name>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.250</name>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.251</name>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.252</name>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.253</name>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.254</name>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.255</name>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.0</name>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.1</name>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.2</name>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.3</name>
          <addressOffset>0x80c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.4</name>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.5</name>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.6</name>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.7</name>
          <addressOffset>0x81c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.8</name>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.9</name>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.10</name>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.11</name>
          <addressOffset>0x82c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.12</name>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.13</name>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.14</name>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.15</name>
          <addressOffset>0x83c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.16</name>
          <addressOffset>0x840</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.17</name>
          <addressOffset>0x844</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.18</name>
          <addressOffset>0x848</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.19</name>
          <addressOffset>0x84c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.20</name>
          <addressOffset>0x850</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.21</name>
          <addressOffset>0x854</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.22</name>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.23</name>
          <addressOffset>0x85c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.24</name>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.25</name>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.26</name>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.27</name>
          <addressOffset>0x86c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.28</name>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.29</name>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.30</name>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.31</name>
          <addressOffset>0x87c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.32</name>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.33</name>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.34</name>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.35</name>
          <addressOffset>0x88c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.36</name>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.37</name>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.38</name>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
        </register>
